app/Controllers/User.php

INSERT INTO `user` (`name`, `email`, `contact_no`) VALUES ('mantwis', 'mant@gmail.com', '84572836372')
---
    public function create(){
        $session = \Config\Services::session();
        helper('form');

        $data = [];

        if($this->request->getMethod()=='post'){
                $input = $this->validate([
                    'name'=>'required|min_length[6]',
                    'email'=>'required|valid_email',
                    'contact_no'=>'required|min_length[10]'
                ]);

                if($input==true){
                    //form validated successfully
                    $model = new UserModel();

                    $model->save([
                        'name' => $this->request->getPost('name'),
                        'email' => $this->request->getPost('email'),
                        'contact_no' => $this->request->getPost('contact_no')
                    ]);

DELETE FROM `user`
WHERE `id` IN ('16')
---
        public function delete($id){
            $session = \Config\Services::session();

            $model = new UserModel();
            $user = $model->getRow($id);

            if(empty($user)){
                $session->setFlashdata('error', 'Record not found');
                return redirect()->to('/users');
            }

            $model = new UserModel();
            $model->delete($id);