app/Models/UserModel.php

    public function getRecords() {
        return $this->orderBy('id','DESC')->findAll();
---
SELECT *
FROM `user`
ORDER BY `id` DESC

    public function getRow($id) {
        // SELECT * FROM users where id = $id
        return $this->where('id',$id)->first();
---
SELECT *
FROM `user`
WHERE `id` = '16'
 LIMIT 1